espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_reg.h
/** CACHE_L1_CACHE_DATA_MEM_ACS_CONF_REG register
 *  Cache data memory access configure register
 */
#define CACHE_L1_CACHE_DATA_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x30)
/** CACHE_L1_ICACHE0_DATA_MEM_RD_EN : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable config-bus read L1-ICache0 data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN    (BIT(0))
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE0_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE0_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_S  0
/** CACHE_L1_ICACHE0_DATA_MEM_WR_EN : R/W; bitpos: [1]; default: 1;
 *  The bit is used to enable config-bus write L1-ICache0 data memoryory. 0: disable,
 *  1: enable.
 */
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN    (BIT(1))
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE0_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE0_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_S  1
/** CACHE_L1_ICACHE1_DATA_MEM_RD_EN : R/W; bitpos: [4]; default: 1;
 *  The bit is used to enable config-bus read L1-ICache1 data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN    (BIT(4))
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE1_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE1_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_S  4
/** CACHE_L1_ICACHE1_DATA_MEM_WR_EN : R/W; bitpos: [5]; default: 1;
 *  The bit is used to enable config-bus write L1-ICache1 data memoryory. 0: disable,
 *  1: enable.
 */
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN    (BIT(5))
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE1_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE1_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_S  5
/** CACHE_L1_ICACHE2_DATA_MEM_RD_EN : HRO; bitpos: [8]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN    (BIT(8))
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE2_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE2_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_S  8
/** CACHE_L1_ICACHE2_DATA_MEM_WR_EN : HRO; bitpos: [9]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN    (BIT(9))
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE2_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE2_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_S  9
/** CACHE_L1_ICACHE3_DATA_MEM_RD_EN : HRO; bitpos: [12]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN    (BIT(12))
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE3_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE3_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_S  12
/** CACHE_L1_ICACHE3_DATA_MEM_WR_EN : HRO; bitpos: [13]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN    (BIT(13))
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE3_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE3_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_S  13
/** CACHE_L1_DCACHE_DATA_MEM_RD_EN : R/W; bitpos: [16]; default: 1;
 *  The bit is used to enable config-bus read L1-DCache data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN    (BIT(16))
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_M  (CACHE_L1_DCACHE_DATA_MEM_RD_EN_V << CACHE_L1_DCACHE_DATA_MEM_RD_EN_S)
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_S  16
/** CACHE_L1_DCACHE_DATA_MEM_WR_EN : R/W; bitpos: [17]; default: 1;
 *  The bit is used to enable config-bus write L1-DCache data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN    (BIT(17))
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_M  (CACHE_L1_DCACHE_DATA_MEM_WR_EN_V << CACHE_L1_DCACHE_DATA_MEM_WR_EN_S)
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_S  17

/** CACHE_L1_CACHE_TAG_MEM_ACS_CONF_REG register
 *  Cache tag memory access configure register
 */
#define CACHE_L1_CACHE_TAG_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x34)
/** CACHE_L1_ICACHE0_TAG_MEM_RD_EN : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable config-bus read L1-ICache0 tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN    (BIT(0))
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE0_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE0_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_S  0
/** CACHE_L1_ICACHE0_TAG_MEM_WR_EN : R/W; bitpos: [1]; default: 1;
 *  The bit is used to enable config-bus write L1-ICache0 tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN    (BIT(1))
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE0_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE0_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_S  1
/** CACHE_L1_ICACHE1_TAG_MEM_RD_EN : R/W; bitpos: [4]; default: 1;
 *  The bit is used to enable config-bus read L1-ICache1 tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN    (BIT(4))
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE1_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE1_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_S  4
/** CACHE_L1_ICACHE1_TAG_MEM_WR_EN : R/W; bitpos: [5]; default: 1;
 *  The bit is used to enable config-bus write L1-ICache1 tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN    (BIT(5))
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE1_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE1_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_S  5
/** CACHE_L1_ICACHE2_TAG_MEM_RD_EN : HRO; bitpos: [8]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN    (BIT(8))
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE2_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE2_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_S  8
/** CACHE_L1_ICACHE2_TAG_MEM_WR_EN : HRO; bitpos: [9]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN    (BIT(9))
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE2_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE2_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_S  9
/** CACHE_L1_ICACHE3_TAG_MEM_RD_EN : HRO; bitpos: [12]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN    (BIT(12))
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE3_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE3_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_S  12
/** CACHE_L1_ICACHE3_TAG_MEM_WR_EN : HRO; bitpos: [13]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN    (BIT(13))
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE3_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE3_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_S  13
/** CACHE_L1_DCACHE_TAG_MEM_RD_EN : R/W; bitpos: [16]; default: 1;
 *  The bit is used to enable config-bus read L1-DCache tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN    (BIT(16))
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_M  (CACHE_L1_DCACHE_TAG_MEM_RD_EN_V << CACHE_L1_DCACHE_TAG_MEM_RD_EN_S)
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_S  16
/** CACHE_L1_DCACHE_TAG_MEM_WR_EN : R/W; bitpos: [17]; default: 1;
 *  The bit is used to enable config-bus write L1-DCache tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN    (BIT(17))
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_M  (CACHE_L1_DCACHE_TAG_MEM_WR_EN_V << CACHE_L1_DCACHE_TAG_MEM_WR_EN_S)
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_S  17

