espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_reg.h
/** CACHE_L1_ICACHE2_PRELOCK_SCT_SIZE_REG register
 *  L1 instruction Cache 2 prelock section size configure register
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x64)
/** CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE : HRO; bitpos: [13:0]; default: 16383;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE_M  (CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE_V << CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE : HRO; bitpos: [29:16]; default: 16383;
 *  Those bits are used to configure the size of the second section of prelock on
 *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE_M  (CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE_V << CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_SIZE_S  16

/** CACHE_L1_ICACHE3_PRELOCK_CONF_REG register
 *  L1 instruction Cache 3 prelock configure register
 */
#define CACHE_L1_ICACHE3_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x68)
/** CACHE_L1_ICACHE3_PRELOCK_SCT0_EN : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable the first section of prelock function on L1-ICache3.
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_EN_M  (CACHE_L1_ICACHE3_PRELOCK_SCT0_EN_V << CACHE_L1_ICACHE3_PRELOCK_SCT0_EN_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_EN_S  0
/** CACHE_L1_ICACHE3_PRELOCK_SCT1_EN : HRO; bitpos: [1]; default: 0;
 *  The bit is used to enable the second section of prelock function on L1-ICache3.
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_EN_M  (CACHE_L1_ICACHE3_PRELOCK_SCT1_EN_V << CACHE_L1_ICACHE3_PRELOCK_SCT1_EN_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_EN_S  1
/** CACHE_L1_ICACHE3_PRELOCK_RGID : HRO; bitpos: [5:2]; default: 0;
 *  The bit is used to set  the gid of l1 icache3 prelock.
 */
#define CACHE_L1_ICACHE3_PRELOCK_RGID    0x0000000FU
#define CACHE_L1_ICACHE3_PRELOCK_RGID_M  (CACHE_L1_ICACHE3_PRELOCK_RGID_V << CACHE_L1_ICACHE3_PRELOCK_RGID_S)
#define CACHE_L1_ICACHE3_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE3_PRELOCK_RGID_S  2

/** CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_REG register
 *  L1 instruction Cache 3 prelock section0 address configure register
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x6c)
/** CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the first section of
 *  prelock on L1-ICache3, which should be used together with
 *  L1_ICACHE3_PRELOCK_SCT0_SIZE_REG
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_M  (CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_V << CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_REG register
 *  L1 instruction Cache 3 prelock section1 address configure register
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x70)
/** CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the second section of
 *  prelock on L1-ICache3, which should be used together with
 *  L1_ICACHE3_PRELOCK_SCT1_SIZE_REG
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_M  (CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_V << CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE3_PRELOCK_SCT_SIZE_REG register
 *  L1 instruction Cache 3 prelock section size configure register
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x74)
/** CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE : HRO; bitpos: [13:0]; default: 16383;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE_M  (CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE_V << CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE : HRO; bitpos: [29:16]; default: 16383;
 *  Those bits are used to configure the size of the second section of prelock on
 *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE_M  (CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE_V << CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE_S)
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOCK_SCT1_SIZE_S  16

/** CACHE_L1_DCACHE_PRELOCK_CONF_REG register
 *  L1 data Cache prelock configure register
 */
#define CACHE_L1_DCACHE_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x78)
/** CACHE_L1_DCACHE_PRELOCK_SCT0_EN : R/W; bitpos: [0]; default: 0;
 *  The bit is used to enable the first section of prelock function on L1-DCache.
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L1_DCACHE_PRELOCK_SCT0_EN_M  (CACHE_L1_DCACHE_PRELOCK_SCT0_EN_V << CACHE_L1_DCACHE_PRELOCK_SCT0_EN_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOCK_SCT0_EN_S  0
/** CACHE_L1_DCACHE_PRELOCK_SCT1_EN : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable the second section of prelock function on L1-DCache.
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L1_DCACHE_PRELOCK_SCT1_EN_M  (CACHE_L1_DCACHE_PRELOCK_SCT1_EN_V << CACHE_L1_DCACHE_PRELOCK_SCT1_EN_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOCK_SCT1_EN_S  1
/** CACHE_L1_DCACHE_PRELOCK_RGID : R/W; bitpos: [5:2]; default: 0;
 *  The bit is used to set  the gid of l1 dcache prelock.
 */
#define CACHE_L1_DCACHE_PRELOCK_RGID    0x0000000FU
#define CACHE_L1_DCACHE_PRELOCK_RGID_M  (CACHE_L1_DCACHE_PRELOCK_RGID_V << CACHE_L1_DCACHE_PRELOCK_RGID_S)
#define CACHE_L1_DCACHE_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L1_DCACHE_PRELOCK_RGID_S  2

/** CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_REG register
 *  L1 data Cache prelock section0 address configure register
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x7c)
/** CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the first section of
 *  prelock on L1-DCache, which should be used together with
 *  L1_DCACHE_PRELOCK_SCT0_SIZE_REG
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_M  (CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_V << CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_REG register
 *  L1 data Cache prelock section1 address configure register
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x80)
/** CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the second section of
 *  prelock on L1-DCache, which should be used together with
 *  L1_DCACHE_PRELOCK_SCT1_SIZE_REG
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_M  (CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_V << CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT1_ADDR_S  0

/** CACHE_L1_DCACHE_PRELOCK_SCT_SIZE_REG register
 *  L1 data Cache prelock section size configure register
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x84)
/** CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE : R/W; bitpos: [13:0]; default: 16383;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE    0x00003FFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE_M  (CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE_V << CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE_V  0x00003FFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE : R/W; bitpos: [29:16]; default: 16383;
 *  Those bits are used to configure the size of the second section of prelock on
 *  L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE    0x00003FFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE_M  (CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE_V << CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE_S)
#define CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE_V  0x00003FFFU
#define CACHE_L1_DCACHE_PRELOCK_SCT1_SIZE_S  16

/** CACHE_LOCK_CTRL_REG register
 *  Lock-class (manual lock) operation control register
 */
#define CACHE_LOCK_CTRL_REG (DR_REG_CACHE_BASE + 0x88)
/** CACHE_LOCK_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable lock operation. It will be cleared by hardware after lock
 *  operation done. Note that (1) this bit and unlock_ena bit are mutually exclusive,
 *  that is, those bits can not be set to 1 at the same time. (2) lock operation can be
 *  applied on LL1-ICache, L1-DCache and L2-Cache.
 */
#define CACHE_LOCK_ENA    (BIT(0))
#define CACHE_LOCK_ENA_M  (CACHE_LOCK_ENA_V << CACHE_LOCK_ENA_S)
#define CACHE_LOCK_ENA_V  0x00000001U
#define CACHE_LOCK_ENA_S  0
/** CACHE_UNLOCK_ENA : R/W/SC; bitpos: [1]; default: 0;
 *  The bit is used to enable unlock operation. It will be cleared by hardware after
 *  unlock operation done. Note that (1) this bit and lock_ena bit are mutually
 *  exclusive, that is, those bits can not be set to 1 at the same time. (2) unlock
 *  operation can be applied on L1-ICache, L1-DCache and L2-Cache.
 */
#define CACHE_UNLOCK_ENA    (BIT(1))
#define CACHE_UNLOCK_ENA_M  (CACHE_UNLOCK_ENA_V << CACHE_UNLOCK_ENA_S)
#define CACHE_UNLOCK_ENA_V  0x00000001U
#define CACHE_UNLOCK_ENA_S  1
/** CACHE_LOCK_DONE : RO; bitpos: [2]; default: 1;
 *  The bit is used to indicate whether unlock/lock operation is finished or not. 0:
 *  not finished. 1: finished.
 */
#define CACHE_LOCK_DONE    (BIT(2))
#define CACHE_LOCK_DONE_M  (CACHE_LOCK_DONE_V << CACHE_LOCK_DONE_S)
#define CACHE_LOCK_DONE_V  0x00000001U
#define CACHE_LOCK_DONE_S  2
/** CACHE_LOCK_RGID : R/W; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of cache lock/unlock.
 */
#define CACHE_LOCK_RGID    0x0000000FU
#define CACHE_LOCK_RGID_M  (CACHE_LOCK_RGID_V << CACHE_LOCK_RGID_S)
#define CACHE_LOCK_RGID_V  0x0000000FU
#define CACHE_LOCK_RGID_S  3

/** CACHE_LOCK_MAP_REG register
 *  Lock (manual lock) map configure register
 */
#define CACHE_LOCK_MAP_REG (DR_REG_CACHE_BASE + 0x8c)
/** CACHE_LOCK_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Those bits are used to indicate which caches in the two-level cache structure will
 *  apply this lock/unlock operation. [0]: L1-ICache0, [1]: L1-ICache1, [2]:
 *  L1-ICache2, [3]: L1-ICache3, [4]: L1-DCache, [5]: L2-Cache.
 */
#define CACHE_LOCK_MAP    0x0000003FU
#define CACHE_LOCK_MAP_M  (CACHE_LOCK_MAP_V << CACHE_LOCK_MAP_S)
#define CACHE_LOCK_MAP_V  0x0000003FU
#define CACHE_LOCK_MAP_S  0

/** CACHE_LOCK_ADDR_REG register
 *  Lock (manual lock) address configure register
 */
#define CACHE_LOCK_ADDR_REG (DR_REG_CACHE_BASE + 0x90)
/** CACHE_LOCK_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the lock/unlock
 *  operation, which should be used together with CACHE_LOCK_SIZE_REG
 */
#define CACHE_LOCK_ADDR    0xFFFFFFFFU
#define CACHE_LOCK_ADDR_M  (CACHE_LOCK_ADDR_V << CACHE_LOCK_ADDR_S)
#define CACHE_LOCK_ADDR_V  0xFFFFFFFFU
#define CACHE_LOCK_ADDR_S  0

