espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_reg.h
/** CACHE_SYNC_L1_CACHE_PRELOAD_EXCEPTION_REG register
 *  Cache Sync/Preload Operation exception register
 */
#define CACHE_SYNC_L1_CACHE_PRELOAD_EXCEPTION_REG (DR_REG_CACHE_BASE + 0x248)
/** CACHE_L1_ICACHE0_PLD_ERR_CODE : RO; bitpos: [1:0]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-ICache0.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_M  (CACHE_L1_ICACHE0_PLD_ERR_CODE_V << CACHE_L1_ICACHE0_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_S  0
/** CACHE_L1_ICACHE1_PLD_ERR_CODE : RO; bitpos: [3:2]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-ICache1.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_M  (CACHE_L1_ICACHE1_PLD_ERR_CODE_V << CACHE_L1_ICACHE1_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_S  2
/** CACHE_L1_ICACHE2_PLD_ERR_CODE : RO; bitpos: [5:4]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_M  (CACHE_L1_ICACHE2_PLD_ERR_CODE_V << CACHE_L1_ICACHE2_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_S  4
/** CACHE_L1_ICACHE3_PLD_ERR_CODE : RO; bitpos: [7:6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_M  (CACHE_L1_ICACHE3_PLD_ERR_CODE_V << CACHE_L1_ICACHE3_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_S  6
/** CACHE_L1_DCACHE_PLD_ERR_CODE : RO; bitpos: [9:8]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-DCache.
 */
#define CACHE_L1_DCACHE_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_DCACHE_PLD_ERR_CODE_M  (CACHE_L1_DCACHE_PLD_ERR_CODE_V << CACHE_L1_DCACHE_PLD_ERR_CODE_S)
#define CACHE_L1_DCACHE_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_DCACHE_PLD_ERR_CODE_S  8
/** CACHE_SYNC_ERR_CODE : RO; bitpos: [13:12]; default: 0;
 *  The values 0-2 are available which means sync map, command conflict and size are
 *  error in Cache System.
 */
#define CACHE_SYNC_ERR_CODE    0x00000003U
#define CACHE_SYNC_ERR_CODE_M  (CACHE_SYNC_ERR_CODE_V << CACHE_SYNC_ERR_CODE_S)
#define CACHE_SYNC_ERR_CODE_V  0x00000003U
#define CACHE_SYNC_ERR_CODE_S  12

/** CACHE_L1_CACHE_SYNC_RST_CTRL_REG register
 *  Cache Sync Reset control register
 */
#define CACHE_L1_CACHE_SYNC_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x24c)
/** CACHE_L1_ICACHE0_SYNC_RST : R/W; bitpos: [0]; default: 0;
 *  set this bit to reset sync-logic inside L1-ICache0. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_ICACHE0_SYNC_RST    (BIT(0))
#define CACHE_L1_ICACHE0_SYNC_RST_M  (CACHE_L1_ICACHE0_SYNC_RST_V << CACHE_L1_ICACHE0_SYNC_RST_S)
#define CACHE_L1_ICACHE0_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE0_SYNC_RST_S  0
/** CACHE_L1_ICACHE1_SYNC_RST : R/W; bitpos: [1]; default: 0;
 *  set this bit to reset sync-logic inside L1-ICache1. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_ICACHE1_SYNC_RST    (BIT(1))
#define CACHE_L1_ICACHE1_SYNC_RST_M  (CACHE_L1_ICACHE1_SYNC_RST_V << CACHE_L1_ICACHE1_SYNC_RST_S)
#define CACHE_L1_ICACHE1_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE1_SYNC_RST_S  1
/** CACHE_L1_ICACHE2_SYNC_RST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_SYNC_RST    (BIT(2))
#define CACHE_L1_ICACHE2_SYNC_RST_M  (CACHE_L1_ICACHE2_SYNC_RST_V << CACHE_L1_ICACHE2_SYNC_RST_S)
#define CACHE_L1_ICACHE2_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE2_SYNC_RST_S  2
/** CACHE_L1_ICACHE3_SYNC_RST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_SYNC_RST    (BIT(3))
#define CACHE_L1_ICACHE3_SYNC_RST_M  (CACHE_L1_ICACHE3_SYNC_RST_V << CACHE_L1_ICACHE3_SYNC_RST_S)
#define CACHE_L1_ICACHE3_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE3_SYNC_RST_S  3
/** CACHE_L1_DCACHE_SYNC_RST : R/W; bitpos: [4]; default: 0;
 *  set this bit to reset sync-logic inside L1-DCache. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_DCACHE_SYNC_RST    (BIT(4))
#define CACHE_L1_DCACHE_SYNC_RST_M  (CACHE_L1_DCACHE_SYNC_RST_V << CACHE_L1_DCACHE_SYNC_RST_S)
#define CACHE_L1_DCACHE_SYNC_RST_V  0x00000001U
#define CACHE_L1_DCACHE_SYNC_RST_S  4

/** CACHE_L1_CACHE_PRELOAD_RST_CTRL_REG register
 *  Cache Preload Reset control register
 */
#define CACHE_L1_CACHE_PRELOAD_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x250)
/** CACHE_L1_ICACHE0_PLD_RST : R/W; bitpos: [0]; default: 0;
 *  set this bit to reset preload-logic inside L1-ICache0. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_ICACHE0_PLD_RST    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_RST_M  (CACHE_L1_ICACHE0_PLD_RST_V << CACHE_L1_ICACHE0_PLD_RST_S)
#define CACHE_L1_ICACHE0_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_RST_S  0
/** CACHE_L1_ICACHE1_PLD_RST : R/W; bitpos: [1]; default: 0;
 *  set this bit to reset preload-logic inside L1-ICache1. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_ICACHE1_PLD_RST    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_RST_M  (CACHE_L1_ICACHE1_PLD_RST_V << CACHE_L1_ICACHE1_PLD_RST_S)
#define CACHE_L1_ICACHE1_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_RST_S  1
/** CACHE_L1_ICACHE2_PLD_RST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_RST    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_RST_M  (CACHE_L1_ICACHE2_PLD_RST_V << CACHE_L1_ICACHE2_PLD_RST_S)
#define CACHE_L1_ICACHE2_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_RST_S  2
/** CACHE_L1_ICACHE3_PLD_RST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_RST    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_RST_M  (CACHE_L1_ICACHE3_PLD_RST_V << CACHE_L1_ICACHE3_PLD_RST_S)
#define CACHE_L1_ICACHE3_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_RST_S  3
/** CACHE_L1_DCACHE_PLD_RST : R/W; bitpos: [4]; default: 0;
 *  set this bit to reset preload-logic inside L1-DCache. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_DCACHE_PLD_RST    (BIT(4))
#define CACHE_L1_DCACHE_PLD_RST_M  (CACHE_L1_DCACHE_PLD_RST_V << CACHE_L1_DCACHE_PLD_RST_S)
#define CACHE_L1_DCACHE_PLD_RST_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_RST_S  4

