espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_reg.h
/** CACHE_L2_BYPASS_CACHE_CONF_REG register
 *  Bypass Cache configure register
 */
#define CACHE_L2_BYPASS_CACHE_CONF_REG (DR_REG_CACHE_BASE + 0x274)
/** CACHE_BYPASS_L2_CACHE_EN : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable bypass L2-Cache. 0: disable bypass, 1: enable bypass.
 */
#define CACHE_BYPASS_L2_CACHE_EN    (BIT(5))
#define CACHE_BYPASS_L2_CACHE_EN_M  (CACHE_BYPASS_L2_CACHE_EN_V << CACHE_BYPASS_L2_CACHE_EN_S)
#define CACHE_BYPASS_L2_CACHE_EN_V  0x00000001U
#define CACHE_BYPASS_L2_CACHE_EN_S  5

/** CACHE_L2_CACHE_CACHESIZE_CONF_REG register
 *  L2 Cache CacheSize mode configure register
 */
#define CACHE_L2_CACHE_CACHESIZE_CONF_REG (DR_REG_CACHE_BASE + 0x278)
/** CACHE_L2_CACHE_CACHESIZE_256 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_256    (BIT(0))
#define CACHE_L2_CACHE_CACHESIZE_256_M  (CACHE_L2_CACHE_CACHESIZE_256_V << CACHE_L2_CACHE_CACHESIZE_256_S)
#define CACHE_L2_CACHE_CACHESIZE_256_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_256_S  0
/** CACHE_L2_CACHE_CACHESIZE_512 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 512 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_512    (BIT(1))
#define CACHE_L2_CACHE_CACHESIZE_512_M  (CACHE_L2_CACHE_CACHESIZE_512_V << CACHE_L2_CACHE_CACHESIZE_512_S)
#define CACHE_L2_CACHE_CACHESIZE_512_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_512_S  1
/** CACHE_L2_CACHE_CACHESIZE_1K : HRO; bitpos: [2]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 1k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_1K    (BIT(2))
#define CACHE_L2_CACHE_CACHESIZE_1K_M  (CACHE_L2_CACHE_CACHESIZE_1K_V << CACHE_L2_CACHE_CACHESIZE_1K_S)
#define CACHE_L2_CACHE_CACHESIZE_1K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_1K_S  2
/** CACHE_L2_CACHE_CACHESIZE_2K : HRO; bitpos: [3]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 2k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_2K    (BIT(3))
#define CACHE_L2_CACHE_CACHESIZE_2K_M  (CACHE_L2_CACHE_CACHESIZE_2K_V << CACHE_L2_CACHE_CACHESIZE_2K_S)
#define CACHE_L2_CACHE_CACHESIZE_2K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_2K_S  3
/** CACHE_L2_CACHE_CACHESIZE_4K : HRO; bitpos: [4]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 4k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_4K    (BIT(4))
#define CACHE_L2_CACHE_CACHESIZE_4K_M  (CACHE_L2_CACHE_CACHESIZE_4K_V << CACHE_L2_CACHE_CACHESIZE_4K_S)
#define CACHE_L2_CACHE_CACHESIZE_4K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_4K_S  4
/** CACHE_L2_CACHE_CACHESIZE_8K : HRO; bitpos: [5]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 8k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_8K    (BIT(5))
#define CACHE_L2_CACHE_CACHESIZE_8K_M  (CACHE_L2_CACHE_CACHESIZE_8K_V << CACHE_L2_CACHE_CACHESIZE_8K_S)
#define CACHE_L2_CACHE_CACHESIZE_8K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_8K_S  5
/** CACHE_L2_CACHE_CACHESIZE_16K : HRO; bitpos: [6]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 16k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_16K    (BIT(6))
#define CACHE_L2_CACHE_CACHESIZE_16K_M  (CACHE_L2_CACHE_CACHESIZE_16K_V << CACHE_L2_CACHE_CACHESIZE_16K_S)
#define CACHE_L2_CACHE_CACHESIZE_16K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_16K_S  6
/** CACHE_L2_CACHE_CACHESIZE_32K : HRO; bitpos: [7]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 32k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_32K    (BIT(7))
#define CACHE_L2_CACHE_CACHESIZE_32K_M  (CACHE_L2_CACHE_CACHESIZE_32K_V << CACHE_L2_CACHE_CACHESIZE_32K_S)
#define CACHE_L2_CACHE_CACHESIZE_32K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_32K_S  7
/** CACHE_L2_CACHE_CACHESIZE_64K : HRO; bitpos: [8]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 64k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_64K    (BIT(8))
#define CACHE_L2_CACHE_CACHESIZE_64K_M  (CACHE_L2_CACHE_CACHESIZE_64K_V << CACHE_L2_CACHE_CACHESIZE_64K_S)
#define CACHE_L2_CACHE_CACHESIZE_64K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_64K_S  8
/** CACHE_L2_CACHE_CACHESIZE_128K : R/W; bitpos: [9]; default: 1;
 *  The field is used to configure cachesize of L2-Cache as 128k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_128K    (BIT(9))
#define CACHE_L2_CACHE_CACHESIZE_128K_M  (CACHE_L2_CACHE_CACHESIZE_128K_V << CACHE_L2_CACHE_CACHESIZE_128K_S)
#define CACHE_L2_CACHE_CACHESIZE_128K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_128K_S  9
/** CACHE_L2_CACHE_CACHESIZE_256K : R/W; bitpos: [10]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 256k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_256K    (BIT(10))
#define CACHE_L2_CACHE_CACHESIZE_256K_M  (CACHE_L2_CACHE_CACHESIZE_256K_V << CACHE_L2_CACHE_CACHESIZE_256K_S)
#define CACHE_L2_CACHE_CACHESIZE_256K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_256K_S  10
/** CACHE_L2_CACHE_CACHESIZE_512K : R/W; bitpos: [11]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 512k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_512K    (BIT(11))
#define CACHE_L2_CACHE_CACHESIZE_512K_M  (CACHE_L2_CACHE_CACHESIZE_512K_V << CACHE_L2_CACHE_CACHESIZE_512K_S)
#define CACHE_L2_CACHE_CACHESIZE_512K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_512K_S  11
/** CACHE_L2_CACHE_CACHESIZE_1024K : HRO; bitpos: [12]; default: 0;
 *  The field is used to configure cachesize of L2-Cache as 1024k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_CACHESIZE_1024K    (BIT(12))
#define CACHE_L2_CACHE_CACHESIZE_1024K_M  (CACHE_L2_CACHE_CACHESIZE_1024K_V << CACHE_L2_CACHE_CACHESIZE_1024K_S)
#define CACHE_L2_CACHE_CACHESIZE_1024K_V  0x00000001U
#define CACHE_L2_CACHE_CACHESIZE_1024K_S  12

/** CACHE_L2_CACHE_BLOCKSIZE_CONF_REG register
 *  L2 Cache BlockSize mode configure register
 */
#define CACHE_L2_CACHE_BLOCKSIZE_CONF_REG (DR_REG_CACHE_BASE + 0x27c)
/** CACHE_L2_CACHE_BLOCKSIZE_8 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configureblocksize of L2-Cache as 8 bytes. This field and all
 *  other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_8    (BIT(0))
#define CACHE_L2_CACHE_BLOCKSIZE_8_M  (CACHE_L2_CACHE_BLOCKSIZE_8_V << CACHE_L2_CACHE_BLOCKSIZE_8_S)
#define CACHE_L2_CACHE_BLOCKSIZE_8_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_8_S  0
/** CACHE_L2_CACHE_BLOCKSIZE_16 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configureblocksize of L2-Cache as 16 bytes. This field and all
 *  other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_16    (BIT(1))
#define CACHE_L2_CACHE_BLOCKSIZE_16_M  (CACHE_L2_CACHE_BLOCKSIZE_16_V << CACHE_L2_CACHE_BLOCKSIZE_16_S)
#define CACHE_L2_CACHE_BLOCKSIZE_16_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_16_S  1
/** CACHE_L2_CACHE_BLOCKSIZE_32 : HRO; bitpos: [2]; default: 0;
 *  The field is used to configureblocksize of L2-Cache as 32 bytes. This field and all
 *  other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_32    (BIT(2))
#define CACHE_L2_CACHE_BLOCKSIZE_32_M  (CACHE_L2_CACHE_BLOCKSIZE_32_V << CACHE_L2_CACHE_BLOCKSIZE_32_S)
#define CACHE_L2_CACHE_BLOCKSIZE_32_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_32_S  2
/** CACHE_L2_CACHE_BLOCKSIZE_64 : R/W; bitpos: [3]; default: 1;
 *  The field is used to configureblocksize of L2-Cache as 64 bytes. This field and all
 *  other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_64    (BIT(3))
#define CACHE_L2_CACHE_BLOCKSIZE_64_M  (CACHE_L2_CACHE_BLOCKSIZE_64_V << CACHE_L2_CACHE_BLOCKSIZE_64_S)
#define CACHE_L2_CACHE_BLOCKSIZE_64_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_64_S  3
/** CACHE_L2_CACHE_BLOCKSIZE_128 : R/W; bitpos: [4]; default: 0;
 *  The field is used to configureblocksize of L2-Cache as 128 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_128    (BIT(4))
#define CACHE_L2_CACHE_BLOCKSIZE_128_M  (CACHE_L2_CACHE_BLOCKSIZE_128_V << CACHE_L2_CACHE_BLOCKSIZE_128_S)
#define CACHE_L2_CACHE_BLOCKSIZE_128_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_128_S  4
/** CACHE_L2_CACHE_BLOCKSIZE_256 : HRO; bitpos: [5]; default: 0;
 *  The field is used to configureblocksize of L2-Cache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L2_CACHE_BLOCKSIZE_256    (BIT(5))
#define CACHE_L2_CACHE_BLOCKSIZE_256_M  (CACHE_L2_CACHE_BLOCKSIZE_256_V << CACHE_L2_CACHE_BLOCKSIZE_256_S)
#define CACHE_L2_CACHE_BLOCKSIZE_256_V  0x00000001U
#define CACHE_L2_CACHE_BLOCKSIZE_256_S  5

/** CACHE_L2_CACHE_WRAP_AROUND_CTRL_REG register
 *  Cache wrap around control register
 */
#define CACHE_L2_CACHE_WRAP_AROUND_CTRL_REG (DR_REG_CACHE_BASE + 0x280)
/** CACHE_L2_CACHE_WRAP : R/W; bitpos: [5]; default: 0;
 *  Set this bit as 1 to enable L2-Cache wrap around mode.
 */
#define CACHE_L2_CACHE_WRAP    (BIT(5))
#define CACHE_L2_CACHE_WRAP_M  (CACHE_L2_CACHE_WRAP_V << CACHE_L2_CACHE_WRAP_S)
#define CACHE_L2_CACHE_WRAP_V  0x00000001U
#define CACHE_L2_CACHE_WRAP_S  5

